  ### Deployment Results ✅

  **jcetina** successfully deployed branch `jcetina/add-vms` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/b7c0d412-3847-401c-871f-787c400d3447/terraform-bin apply -no-color -auto-approve -compact-warnings

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

# azurerm_network_security_group.nsg has been deleted
- resource "azurerm_network_security_group" "nsg" {
    - id                  = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Network/networkSecurityGroups/k8s-subnet-nsg" -> null
      name                = "k8s-subnet-nsg"
      tags                = {}
      # (3 unchanged attributes hidden)
  }

# azurerm_subnet.k8s-subnet has been deleted
- resource "azurerm_subnet" "k8s-subnet" {
    - id                                             = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Network/virtualNetworks/k8s-vnet/subnets/k8s-subnet" -> null
    - name                                           = "k8s-subnet" -> null
      # (7 unchanged attributes hidden)
  }

# azurerm_virtual_network.k8s-vnet has been deleted
- resource "azurerm_virtual_network" "k8s-vnet" {
      id                      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Network/virtualNetworks/k8s-vnet"
    - name                    = "k8s-vnet" -> null
      tags                    = {}
      # (7 unchanged attributes hidden)
  }

# module.k8s-cp[0].azurerm_network_interface.nic has been deleted
- resource "azurerm_network_interface" "nic" {
    - id                            = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Network/networkInterfaces/k8s-cp-0-nic" -> null
      name                          = "k8s-cp-0-nic"
      tags                          = {}
      # (11 unchanged attributes hidden)

      # (1 unchanged block hidden)
  }

# module.k8s-cp[0].azurerm_public_ip.public_ip[0] has been deleted
- resource "azurerm_public_ip" "public_ip" {
    - id                      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Network/publicIPAddresses/k8s-cp-0-public-ip" -> null
      name                    = "k8s-cp-0-public-ip"
      tags                    = {}
      # (10 unchanged attributes hidden)
  }

# module.k8s-node[0].azurerm_network_interface.nic has been deleted
- resource "azurerm_network_interface" "nic" {
    - id                            = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Network/networkInterfaces/k8s-node-0-nic" -> null
      name                          = "k8s-node-0-nic"
      tags                          = {}
      # (11 unchanged attributes hidden)

      # (1 unchanged block hidden)
  }

# module.k8s-node[0].azurerm_public_ip.public_ip[0] has been deleted
- resource "azurerm_public_ip" "public_ip" {
    - id                      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Network/publicIPAddresses/k8s-node-0-public-ip" -> null
      name                    = "k8s-node-0-public-ip"
      tags                    = {}
      # (10 unchanged attributes hidden)
  }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# azurerm_network_security_group.nsg will be created
+ resource "azurerm_network_security_group" "nsg" {
    + id                  = (known after apply)
    + location            = "eastus"
    + name                = "k8s-subnet-nsg"
    + resource_group_name = "k8s"
    + security_rule       = [
        + {
            + access                                     = "Allow"
            + description                                = ""
            + destination_address_prefix                 = "*"
            + destination_address_prefixes               = []
            + destination_application_security_group_ids = []
            + destination_port_range                     = "*"
            + destination_port_ranges                    = []
            + direction                                  = "Inbound"
            + name                                       = "ICMP"
            + priority                                   = 1002
            + protocol                                   = "Icmp"
            + source_address_prefix                      = "*"
            + source_address_prefixes                    = []
            + source_application_security_group_ids      = []
            + source_port_range                          = "*"
            + source_port_ranges                         = []
          },
        + {
            + access                                     = "Allow"
            + description                                = ""
            + destination_address_prefix                 = "*"
            + destination_address_prefixes               = []
            + destination_application_security_group_ids = []
            + destination_port_range                     = "22"
            + destination_port_ranges                    = []
            + direction                                  = "Inbound"
            + name                                       = "SSH"
            + priority                                   = 1001
            + protocol                                   = "Tcp"
            + source_address_prefix                      = "*"
            + source_address_prefixes                    = []
            + source_application_security_group_ids      = []
            + source_port_range                          = "*"
            + source_port_ranges                         = []
          },
      ]
  }

# azurerm_subnet.k8s-subnet will be created
+ resource "azurerm_subnet" "k8s-subnet" {
    + address_prefixes                               = [
        + "10.0.0.0/24",
      ]
    + enforce_private_link_endpoint_network_policies = false
    + enforce_private_link_service_network_policies  = false
    + id                                             = (known after apply)
    + name                                           = "k8s-subnet"
    + resource_group_name                            = "k8s"
    + virtual_network_name                           = "k8s-vnet"
  }

# azurerm_subnet_network_security_group_association.example will be created
+ resource "azurerm_subnet_network_security_group_association" "example" {
    + id                        = (known after apply)
    + network_security_group_id = (known after apply)
    + subnet_id                 = (known after apply)
  }

# azurerm_virtual_network.k8s-vnet will be created
+ resource "azurerm_virtual_network" "k8s-vnet" {
    + address_space       = [
        + "10.0.0.0/16",
      ]
    + dns_servers         = (known after apply)
    + guid                = (known after apply)
    + id                  = (known after apply)
    + location            = "eastus"
    + name                = "k8s-vnet"
    + resource_group_name = "k8s"
    + subnet              = (known after apply)
  }

# module.k8s-cp[0].azurerm_linux_virtual_machine.vm will be created
+ resource "azurerm_linux_virtual_machine" "vm" {
    + admin_username                  = "adminuser"
    + allow_extension_operations      = true
    + computer_name                   = (known after apply)
    + disable_password_authentication = true
    + extensions_time_budget          = "PT1H30M"
    + id                              = (known after apply)
    + location                        = "eastus"
    + max_bid_price                   = -1
    + name                            = "k8s-cp-0"
    + network_interface_ids           = (known after apply)
    + patch_mode                      = "ImageDefault"
    + platform_fault_domain           = -1
    + priority                        = "Regular"
    + private_ip_address              = (known after apply)
    + private_ip_addresses            = (known after apply)
    + provision_vm_agent              = true
    + public_ip_address               = (known after apply)
    + public_ip_addresses             = (known after apply)
    + resource_group_name             = "k8s"
    + size                            = "Standard_D4ads_v5"
    + virtual_machine_id              = (known after apply)
    + zone                            = "1"

    + admin_ssh_key {
        + public_key = <<-EOT
              ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDMpJlkSij1jlS09G/cIuX648Jx6aQsNm0w4OOGuQHFIs7JXT9deh/Dnf669s4Qy3D6MxkYWpQ85c4fMYJR66cgtAUhueLMuMaz0jp/v/Y27BiqcH7JR8qeVkIvvhmBDGBze6GGkk7jcuR2v81Uf4qVb2YuM4HfrD/5Md1CJR3oMOlyhTbnzQhzgYreLMEozmePsQlTArP67gX/mGYOZdNI1M7hp6Vt3OTJctg4bmDjkhJgoNbOBQh58ixv8KKtxHIXgdfEBwyBlsPjOMneOFqMWycPh8g9T1NXiU5I0pfyKRhThiQCVDFG8a2kVDe2Ylyp0dhKbmZUechPXIU0QStGiByhhbEEBoWXIyDTLPRKK9JoGV/jo+kay0Y34y9CKiwMFa8KdeYRba+XBp0W+rsHGzolN5YSOxODSTimh7x45KCZw0r9tg29mLpSDac66hzzR9VlBP0ikAoAXcHUTrmKsdQRwRnNJohVilfXgJdsu23GWw2sRe4b4X0M6h43X5c4eld/2vjclC4PEvNv2Jlo2ZALNkZGpD+ujTbsWRJBCGkN3GWKLmPnkkSvJP+v0F32k6FrDUhEBEj7Jk4m2qAuLwhHSdZ7d302hJLHApM+vW4kUYT5psg/MGppK4KvJg63Gu81I/FCd+nnn426UnApzHxEYvtlAWjKTM9TOgOxoQ== jcetina@jasons-mbp.lan
          EOT
        + username   = "adminuser"
      }

    + os_disk {
        + caching                   = "ReadWrite"
        + disk_size_gb              = (known after apply)
        + name                      = (known after apply)
        + storage_account_type      = "Standard_LRS"
        + write_accelerator_enabled = false
      }

    + source_image_reference {
        + offer     = "0001-com-ubuntu-server-jammy"
        + publisher = "Canonical"
        + sku       = "22_04-lts"
        + version   = "latest"
      }
  }

# module.k8s-cp[0].azurerm_network_interface.nic will be created
+ resource "azurerm_network_interface" "nic" {
    + applied_dns_servers           = (known after apply)
    + dns_servers                   = (known after apply)
    + enable_accelerated_networking = false
    + enable_ip_forwarding          = false
    + id                            = (known after apply)
    + internal_dns_name_label       = (known after apply)
    + internal_domain_name_suffix   = (known after apply)
    + location                      = "eastus"
    + mac_address                   = (known after apply)
    + name                          = "k8s-cp-0-nic"
    + private_ip_address            = (known after apply)
    + private_ip_addresses          = (known after apply)
    + resource_group_name           = "k8s"
    + virtual_machine_id            = (known after apply)

    + ip_configuration {
        + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
        + name                                               = "internal"
        + primary                                            = (known after apply)
        + private_ip_address                                 = (known after apply)
        + private_ip_address_allocation                      = "Dynamic"
        + private_ip_address_version                         = "IPv4"
        + public_ip_address_id                               = (known after apply)
        + subnet_id                                          = (known after apply)
      }
  }

# module.k8s-cp[0].azurerm_public_ip.public_ip[0] will be created
+ resource "azurerm_public_ip" "public_ip" {
    + allocation_method       = "Static"
    + fqdn                    = (known after apply)
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 4
    + ip_address              = (known after apply)
    + ip_version              = "IPv4"
    + location                = "eastus"
    + name                    = "k8s-cp-0-public-ip"
    + resource_group_name     = "k8s"
    + sku                     = "Standard"
    + sku_tier                = "Regional"
    + zones                   = [
        + "1",
        + "2",
        + "3",
      ]
  }

# module.k8s-node[0].azurerm_linux_virtual_machine.vm will be created
+ resource "azurerm_linux_virtual_machine" "vm" {
    + admin_username                  = "adminuser"
    + allow_extension_operations      = true
    + computer_name                   = (known after apply)
    + disable_password_authentication = true
    + extensions_time_budget          = "PT1H30M"
    + id                              = (known after apply)
    + location                        = "eastus"
    + max_bid_price                   = -1
    + name                            = "k8s-node-0"
    + network_interface_ids           = (known after apply)
    + patch_mode                      = "ImageDefault"
    + platform_fault_domain           = -1
    + priority                        = "Regular"
    + private_ip_address              = (known after apply)
    + private_ip_addresses            = (known after apply)
    + provision_vm_agent              = true
    + public_ip_address               = (known after apply)
    + public_ip_addresses             = (known after apply)
    + resource_group_name             = "k8s"
    + size                            = "Standard_D4ads_v5"
    + virtual_machine_id              = (known after apply)
    + zone                            = "1"

    + admin_ssh_key {
        + public_key = <<-EOT
              ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDMpJlkSij1jlS09G/cIuX648Jx6aQsNm0w4OOGuQHFIs7JXT9deh/Dnf669s4Qy3D6MxkYWpQ85c4fMYJR66cgtAUhueLMuMaz0jp/v/Y27BiqcH7JR8qeVkIvvhmBDGBze6GGkk7jcuR2v81Uf4qVb2YuM4HfrD/5Md1CJR3oMOlyhTbnzQhzgYreLMEozmePsQlTArP67gX/mGYOZdNI1M7hp6Vt3OTJctg4bmDjkhJgoNbOBQh58ixv8KKtxHIXgdfEBwyBlsPjOMneOFqMWycPh8g9T1NXiU5I0pfyKRhThiQCVDFG8a2kVDe2Ylyp0dhKbmZUechPXIU0QStGiByhhbEEBoWXIyDTLPRKK9JoGV/jo+kay0Y34y9CKiwMFa8KdeYRba+XBp0W+rsHGzolN5YSOxODSTimh7x45KCZw0r9tg29mLpSDac66hzzR9VlBP0ikAoAXcHUTrmKsdQRwRnNJohVilfXgJdsu23GWw2sRe4b4X0M6h43X5c4eld/2vjclC4PEvNv2Jlo2ZALNkZGpD+ujTbsWRJBCGkN3GWKLmPnkkSvJP+v0F32k6FrDUhEBEj7Jk4m2qAuLwhHSdZ7d302hJLHApM+vW4kUYT5psg/MGppK4KvJg63Gu81I/FCd+nnn426UnApzHxEYvtlAWjKTM9TOgOxoQ== jcetina@jasons-mbp.lan
          EOT
        + username   = "adminuser"
      }

    + os_disk {
        + caching                   = "ReadWrite"
        + disk_size_gb              = (known after apply)
        + name                      = (known after apply)
        + storage_account_type      = "Standard_LRS"
        + write_accelerator_enabled = false
      }

    + source_image_reference {
        + offer     = "0001-com-ubuntu-server-jammy"
        + publisher = "Canonical"
        + sku       = "22_04-lts"
        + version   = "latest"
      }
  }

# module.k8s-node[0].azurerm_network_interface.nic will be created
+ resource "azurerm_network_interface" "nic" {
    + applied_dns_servers           = (known after apply)
    + dns_servers                   = (known after apply)
    + enable_accelerated_networking = false
    + enable_ip_forwarding          = false
    + id                            = (known after apply)
    + internal_dns_name_label       = (known after apply)
    + internal_domain_name_suffix   = (known after apply)
    + location                      = "eastus"
    + mac_address                   = (known after apply)
    + name                          = "k8s-node-0-nic"
    + private_ip_address            = (known after apply)
    + private_ip_addresses          = (known after apply)
    + resource_group_name           = "k8s"
    + virtual_machine_id            = (known after apply)

    + ip_configuration {
        + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
        + name                                               = "internal"
        + primary                                            = (known after apply)
        + private_ip_address                                 = (known after apply)
        + private_ip_address_allocation                      = "Dynamic"
        + private_ip_address_version                         = "IPv4"
        + public_ip_address_id                               = (known after apply)
        + subnet_id                                          = (known after apply)
      }
  }

# module.k8s-node[0].azurerm_public_ip.public_ip[0] will be created
+ resource "azurerm_public_ip" "public_ip" {
    + allocation_method       = "Static"
    + fqdn                    = (known after apply)
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 4
    + ip_address              = (known after apply)
    + ip_version              = "IPv4"
    + location                = "eastus"
    + name                    = "k8s-node-0-public-ip"
    + resource_group_name     = "k8s"
    + sku                     = "Standard"
    + sku_tier                = "Regional"
    + zones                   = [
        + "1",
        + "2",
        + "3",
      ]
  }

Plan: 10 to add, 0 to change, 0 to destroy.
azurerm_virtual_network.k8s-vnet: Creating...
module.k8s-cp[0].azurerm_public_ip.public_ip[0]: Creating...
module.k8s-node[0].azurerm_public_ip.public_ip[0]: Creating...
azurerm_virtual_network.k8s-vnet: Creation complete after 5s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Network/virtualNetworks/k8s-vnet]
azurerm_subnet.k8s-subnet: Creating...
module.k8s-cp[0].azurerm_public_ip.public_ip[0]: Creation complete after 6s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Network/publicIPAddresses/k8s-cp-0-public-ip]
module.k8s-node[0].azurerm_public_ip.public_ip[0]: Creation complete after 6s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Network/publicIPAddresses/k8s-node-0-public-ip]
azurerm_subnet.k8s-subnet: Creation complete after 6s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Network/virtualNetworks/k8s-vnet/subnets/k8s-subnet]
module.k8s-node[0].azurerm_network_interface.nic: Creating...
module.k8s-cp[0].azurerm_network_interface.nic: Creating...
azurerm_network_security_group.nsg: Creating...
module.k8s-node[0].azurerm_network_interface.nic: Creation complete after 2s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Network/networkInterfaces/k8s-node-0-nic]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Creating...
azurerm_network_security_group.nsg: Creation complete after 3s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Network/networkSecurityGroups/k8s-subnet-nsg]
azurerm_subnet_network_security_group_association.example: Creating...
module.k8s-cp[0].azurerm_network_interface.nic: Creation complete after 3s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Network/networkInterfaces/k8s-cp-0-nic]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Creating...
azurerm_subnet_network_security_group_association.example: Creation complete after 6s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Network/virtualNetworks/k8s-vnet/subnets/k8s-subnet]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Still creating... [10s elapsed]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Still creating... [10s elapsed]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Still creating... [20s elapsed]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Still creating... [20s elapsed]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Still creating... [30s elapsed]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Still creating... [30s elapsed]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Still creating... [40s elapsed]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Still creating... [40s elapsed]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Creation complete after 48s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Compute/virtualMachines/k8s-node-0]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Still creating... [50s elapsed]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Still creating... [1m0s elapsed]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Still creating... [1m10s elapsed]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Creation complete after 1m20s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Compute/virtualMachines/k8s-cp-0]

Apply complete! Resources: 10 added, 0 changed, 0 destroyed.
```

  </details>